Revit 2027 API
RebarSplice Methods
The RebarSplice type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRebarSpliceGeometry |  Gets the RebarSpliceGeometry.
GetType | Gets the Type of the current instance.
(Inherited from Object)
MoveRebarSpliceGeometry |  Moves the RebarSpliceGeometry with the specified vector.
RotateRebarSpliceGeometry |  Rotates the RebarSpliceGeometry about the given axis and angle.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace